; domain
(define (domain floor-tile)
  (:requirements :typing)
  (:types
    robot tile color - object
  )

  (:predicates
    (robot-at ?r - robot ?x - tile)
    (up ?x - tile ?y - tile)
    (right ?x - tile ?y - tile)
    (painted ?x - tile ?c - color)
    (robot-has ?r - robot ?c - color)
    (available-color ?c - color)
  )

  (:action change-color
    :parameters (?r - robot ?c - color ?c2 - color)
    :precondition (and (robot-has ?r ?c) (available-color ?c2))
    :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2)
    )
  )

  (:action paint-up
    :parameters (?r - robot ?y - tile ?x - tile ?c - color)
    :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x))
    :effect  (painted ?y ?c)
  )

  (:action paint-down
    :parameters (?r - robot ?y - tile ?x - tile ?c - color)
    :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?x ?y))
    :effect (and (painted ?y ?c)
    )
  )

  (:action paint-right
    :parameters (?r - robot ?y - tile ?x - tile ?c - color)
    :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (right ?y ?x))
    :effect (and (painted ?y ?c)
    )
  )

  (:action paint-left
    :parameters (?r - robot ?y - tile ?x - tile ?c - color)
    :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (right ?x ?y))
    :effect (and (painted ?y ?c)
    )
  )

  ; Robot movements
  (:action up
    :parameters (?r - robot ?x - tile ?y - tile)
    :precondition (and (robot-at ?r ?x) (up ?y ?x))
    :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x)))
  )

  (:action down
    :parameters (?r - robot ?x - tile ?y - tile)
    :precondition (and (robot-at ?r ?x) (up ?x ?y))
    :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x)))
  )

  (:action right
    :parameters (?r - robot ?x - tile ?y - tile)
    :precondition (and (robot-at ?r ?x) (right ?y ?x))
    :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x)))
  )

  (:action left
    :parameters (?r - robot ?x - tile ?y - tile)
    :precondition (and (robot-at ?r ?x) (right ?x ?y))
    :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x)))
  )

)

; problem
(define (problem grid_to_all_different_1_6_6)
    (:domain floor-tile)
    (:requirements :typing)
    (:objects color1 color2 color3 color4 color5 color6 - color robot1 - robot tile1 tile2 tile3 tile4 tile5 tile6 - tile)
    (:init (available-color color1) (available-color color2) (available-color color3) (available-color color4) (available-color color5) (available-color color6) (right tile2 tile1) (right tile4 tile3) (right tile6 tile5) (robot-at robot1 tile1) (robot-has robot1 color1) (up tile1 tile3) (up tile2 tile4) (up tile3 tile5) (up tile4 tile6))
    (:goal (and (painted tile1 color1) (painted tile2 color2) (painted tile3 color3) (painted tile4 color4) (painted tile5 color5) (painted tile6 color6)))
)

; plan
1. (down robot1 tile1 tile3)
   deleted: (robot-at robot1 tile1)
   added: (robot-at robot1 tile3)
   goals met: 0 of 6
2. (paint-up robot1 tile1 tile3 color1)
   added: (painted tile1 color1)
   goals met: 1 of 6
3. (change-color robot1 color1 color2)
   deleted: (robot-has robot1 color1)
   added: (robot-has robot1 color2)
   goals met: 1 of 6
4. (change-color robot1 color2 color4)
   deleted: (robot-has robot1 color2)
   added: (robot-has robot1 color4)
   goals met: 1 of 6
5. (paint-right robot1 tile4 tile3 color4)
   added: (painted tile4 color4)
   goals met: 2 of 6
6. (change-color robot1 color4 color2)
   deleted: (robot-has robot1 color4)
   added: (robot-has robot1 color2)
   goals met: 2 of 6
7. (right robot1 tile3 tile4)
   deleted: (robot-at robot1 tile3)
   added: (robot-at robot1 tile4)
   goals met: 2 of 6
8. (paint-up robot1 tile2 tile4 color2)
   added: (painted tile2 color2)
   goals met: 3 of 6
9. (change-color robot1 color2 color3)
   deleted: (robot-has robot1 color2)
   added: (robot-has robot1 color3)
   goals met: 3 of 6
10. (paint-left robot1 tile3 tile4 color3)
   added: (painted tile3 color3)
   goals met: 4 of 6
11. (change-color robot1 color3 color5)
   deleted: (robot-has robot1 color3)
   added: (robot-has robot1 color5)
   goals met: 4 of 6
12. (change-color robot1 color5 color6)
   deleted: (robot-has robot1 color5)
   added: (robot-has robot1 color6)
   goals met: 4 of 6
13. (paint-down robot1 tile6 tile4 color6)
   added: (painted tile6 color6)
   goals met: 5 of 6
14. (change-color robot1 color6 color5)
   deleted: (robot-has robot1 color6)
   added: (robot-has robot1 color5)
   goals met: 5 of 6
15. (left robot1 tile4 tile3)
   deleted: (robot-at robot1 tile4)
   added: (robot-at robot1 tile3)
   goals met: 5 of 6
16. (paint-down robot1 tile5 tile3 color5)
   added: (painted tile5 color5)
   goals met: 6 of 6
